# TiltAngle Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PhotometricWebLightDistribution..::..TiltAngle Property
PhotometricWebLightDistribution Class See Also
---
The tilt angle.
**Namespace:** Autodesk.Revit.DB.Lighting**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public double TiltAngle { get; set; }
```

Visual Basic
---
```text
Public Property TiltAngle As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double TiltAngle {
	double get ();
	void set (double value);
}
```

# ### Field Value
The tilt angle as a numerical value in degrees between -180.0 and 180.0.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: The angle is not valid because it is not between -180.0 and 180.0. |

# See Also
PhotometricWebLightDistribution Class
Autodesk.Revit.DB.Lighting Namespace